import { createStore } from 'vuex';

export const store = createStore({
	state: {
		selectedOffer: [],
		services: [
			{
				id: 1,
				photo: 'https://savanna.in.ua/wp-content/uploads/2019/01/tatoo-tatuazh-800x500.jpg',
				photoSwiper: [
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits__12-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-1-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-3-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-4-min.jpg'
				],
				title: 'ПЕРМАНЕНТ МАКIЯЖУ',
				description:
					'Перманентний макіяж – це чудова, сучасна альтернатива декоративній косметиці. Прекрасна можливість позбавитися необхідності щоденного макіяжу з ефектом ...',
				fullDescription: `Перманентний макіяж – що це таке
					Всі люди, а жінки зокрема, в тій чи іншій мірі прагнуть до досконалості. Гарний одяг, здорове волосся і елегантні манери, безумовно, прикрашають будь-яку жінку. Також важливо підкреслити природну кр     асу обличчя і приховати недоліки. Це можна зробити за допомогою декоративної косметики, однак така зміна буде короткостроковою. Permanent – в перекладі з англійської мови “стійкий”, “довготривалий”. Для клієнта, цей макіяж дає прекрасний свіжий вигляд в будь-який час доби з мінімальними витратами. Нічого не потече, не розмажеться, не треба постійно дивитися у дзеркало і поправляти макіяж! Економити час та завжди бути в  кращому вигляді допоможе послуга перманентного макіяжу, виконана висококваліфікованим майстром.
					
					Перманентний макіяж (татуаж) – процедура з довготривалим ефектом, заснована на методиці точкового введення спеціальними апаратами фарбувальних речовин (пігментів) в поверхневі шари шкіри. Вона допоможе підкреслити, змінити, скоригувати риси обличчя, усунути наявну асиметрію. Процедура безболісна і безкровна, не залишає шрамів і рубців навіть при повторному виконанні.
					
					Перманентний макіяж буває двох видів: декоративний і природний. Природний ПМ тільки підкреслює риси обличчя, а декоративний включає в себе сміливі рішення з різною яскравістю тонів.`,
				offers: [
					{
						offerName: 'Нарощуваня вій (класика)',
						offerPrice: 300,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 2D)',
						offerPrice: 380,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 3D)',
						offerPrice: 400,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 4D+)',
						offerPrice: 480,
						added: false
					},
					{
						offerName: 'Корекція вій класика (2 / 3 тижні)',
						offerPrice: 240,
						added: false
					},
					{
						offerName: 'Корекція вій об’ємне (2 / 3 тижні)',
						offerPrice: 300,
						added: false
					},
					{
						offerName: 'Біо-завивка вій',
						offerPrice: 250,
						added: false
					},
					{
						offerName: 'Зняття нарощених вій (якщо нарощували не в нас)',
						offerPrice: 80,
						added: false
					},
					{
						offerName: 'Зняття нарощених вій (якщо нарощували в нас)',
						offerPrice: 0,
						added: false
					}
				]
			},
			{
				id: 2,
				photo: 'https://savanna.in.ua/wp-content/uploads/2019/01/botoks-inekcii-golovna-800x500.jpg',
				photoSwiper: [
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits__12-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-1-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-3-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-4-min.jpg'
				],
				title: 'БОТОКС ТА ІН’ЄКЦІЇ КРАСИ',
				description:
					'В цьому випадку, інєкції ботоксу – найкраще рішення для збереження молодості. Інєкції ботоксу часто називають “уколами краси”. Вони спрямовані ...',
				fullDescription: `Ботулінотерапія (ін'єкції ботокса та диспорта) - це ін'єкційна процедура ботулотоксином типу А, спрямована на зменшення помітності зморшків і складок шкіри, переважно на обличчі. Ботулотоксин блокує нервово-м'язову передачу нервових імпульсів і через це розслабляє м'язи, в які він потрапив. Цей метод корекції вікових зморшків і інших косметологічних недоліків називають Уколами краси. Ін'єкції - це надійний метод, що застосовується протягом 20 років в косметології для лдя позбавлення зморшків та недоліків. Реальний, моментальний результат, вирішення естетичних і фізіологічних проблем, з якими не можуть впоратися інші ін'єкційні методики, короткий термін реабілітації, швидкість і безболісність процедури - це вагомі аргументи за використання ботулінотерапіі в боротьбі за свою красу і молодість. Торгові назви препаратів ботулотоксину: Ботокс, Диспорт, Ксеомін. Процедури ін'єкцій ботоксу та диспорту проводить лікар косметолог.

					Якщо ви очікуєте на швидкий ефект, тоді ботуінотерапія - ваш вибір. Процедура може проводиться літом та зимою. Зморшки буквально збігають від цієї процедури.`,
				offers: [
					{
						offerName: 'Нарощуваня вій (класика)',
						offerPrice: 300,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 2D)',
						offerPrice: 380,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 3D)',
						offerPrice: 400,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 4D+)',
						offerPrice: 480,
						added: false
					},
					{
						offerName: 'Корекція вій класика (2 / 3 тижні)',
						offerPrice: 240,
						added: false
					},
					{
						offerName: 'Корекція вій об’ємне (2 / 3 тижні)',
						offerPrice: 300,
						added: false
					},
					{
						offerName: 'Біо-завивка вій',
						offerPrice: 250,
						added: false
					},
					{
						offerName: 'Зняття нарощених вій (якщо нарощували не в нас)',
						offerPrice: 80,
						added: false
					},
					{
						offerName: 'Зняття нарощених вій (якщо нарощували в нас)',
						offerPrice: 0,
						added: false
					}
				]
			},
			{
				id: 3,
				photo: 'https://savanna.in.ua/wp-content/uploads/2019/01/naroshchennya-vij-savanna-800x500.jpg',
				photoSwiper: [
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits__12-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-1-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-3-min.jpg',
					'https://barb.ua/uploads/images/articles/narashivanie-resnits/narashhivanie-resnits_main-4-min.jpg'
				],
				title: 'НАРОЩЕННЯ ВІЙ',
				description:
					'Нарощування вій - це наклеювання штучних вій на натуральні волоски. Майстри визначають три основні етапи процесу нарощування: Перший етап: за ...',
				fullDescription: `Етапи нарощування вій
					Нарощування вій - це наклеювання штучних вій на натуральні волоски. Майстри визначають три основні етапи процесу нарощування:
					
					Перший етап: за допомогою професійних подушечок з силікону фахівець закриває нижні вії. Це роблять, щоб на них не потрапив клей;
					
					Другий етап: майстер знезаражує і знежирює натуральні вії;
					
					Третій етап: штучні вії прикріплюються до натуральних завдяки спеціальному клею. На цьому етапі важливо пам'ятати, що недостатньо просто купити клей для нарощування вій, потрібно ще й багато годин практики, щоб навчитися правильно його наносити.
					
					У досвідченого майстра не виникає ніяких труднощів під час процедури. Однак на неї витрачається багато часу — від 1,5 до 2 годин. Тривалість процесу залежить від технік, видів і форм, які використовує лешмейкер.
					які бувають види нарощування вій?
Майстри б'юті-індустрії володіють багатьма техніками і видами нарощування вій. Освітні установи (школи, курси) вчать своїх студентів детально розбиратися в японській, голлівудській, європейській техніці нарощування. Але практикуючі майстри стверджують, що важливо запам'ятати лише єдине відмінність: нарощування буває поштучним і об'ємним. Все інше - просто маркетинговий хід.

Однак починаючому майстру важливо дізнатися про кожну з технік, щоб вміти їх розрізняти самостійно і при необхідності пояснити цю різницю клієнту.

отже, існують такі види нарощування:
Японське - поресничное наклеювання штучних волосків на натуральні. Розмір вій вибирає сам клієнт, але обов'язковим нюансом є те, що найбільші волоски майстер зміцнює із зовнішнього краю ока, поступово зменшуючи довжину до внутрішнього куточка.
 
Американське нарощування мало чим відрізняється від японського. Єдина відмінність-вибір матеріалів. У цьому виді завжди використовують силіконові або каучукові вії. Такі матеріали мають свої переваги, оскільки не бояться вологості і різких змін температур. Вони дозволяють вільно ходити в лазню, басейн або відвідувати морські курорти. Але купити вії для нарощування з таких матеріалів може бути непросто.

індонезійський вид нарощування відрізняється тим, що необхідно нанести на всі вії клеїть склад, багатий на кілька вітамінних комплексів. Так штучні вії довше тримаються, а натуральні тільки зміцнюються.

Нарощування від2D до 5D називають об'ємним . Таке нарощування передбачає приклеювання декількох штучних вій до однієї натуральної. Завдяки цьому створюються ефект пишних і пухнастих вій.

Нарощування пучками виконують за допомогою спеціальних пучків штучних війок, спаяним один з одним. Пучки прикріплюються до натуральних вій з невеликою відстанню один від одного. Ця техніка займає багато часу, але і результат вважається одним з кращих.

Нарощування куточків має на увазі приклеювання штучних війок, починаючи від кута зовнішньої сторони ока і доходячи до середини.
`,
				offers: [
					{
						offerName: 'Нарощуваня вій (класика)',
						offerPrice: 300,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 2D)',
						offerPrice: 380,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 3D)',
						offerPrice: 400,
						added: false
					},
					{
						offerName: 'Нарощуваня вій (об’єм 4D+)',
						offerPrice: 480,
						added: false
					},
					{
						offerName: 'Корекція вій класика (2 / 3 тижні)',
						offerPrice: 240,
						added: false
					},
					{
						offerName: 'Корекція вій об’ємне (2 / 3 тижні)',
						offerPrice: 300,
						added: false
					},
					{
						offerName: 'Біо-завивка вій',
						offerPrice: 250,
						added: false
					},
					{
						offerName: 'Зняття нарощених вій (якщо нарощували не в нас)',
						offerPrice: 80,
						added: false
					},
					{
						offerName: 'Зняття нарощених вій (якщо нарощували в нас)',
						offerPrice: 0,
						added: false
					}
				]
			}
		]
	},
	mutations: {
		setSelectedOffer(state, item) {
			state.selectedOffer = [item];
		}
	}
});
