const classesStoreModule = {
	state: {
		moreLess: [
			{
				title: 'SOME TITLE FIRST',
				text: 'Однако, если вы не можете использовать v-modelна входе, вы можете использовать вычисляемые установщики для таких случаев, как состояние Vuex и другие сложные типы ввода, где задействовано более одного элемента состояния. Для получения дополнительной информации об использовании вычисляемых сеттеров вы можете обратиться к расширенному руководству .'
			},
			{
				title: 'SOME TITLE SECOND',
				text: 'Однако, если вы не можете использовать v-modelна входе, вы можете использовать вычисляемые установщики для таких случаев, как состояние Vuex и другие сложные типы ввода, где задействовано более одного элемента состояния. Для получения дополнительной информации об использовании вычисляемых сеттеров вы можете обратиться к расширенному руководству .'
			},
			{
				title: 'SOME TITLE THIRD',
				text: 'Однако, если вы не можете использовать v-modelна входе, вы можете использовать вычисляемые установщики для таких случаев, как состояние Vuex и другие сложные типы ввода, где задействовано более одного элемента состояния. Для получения дополнительной информации об использовании вычисляемых сеттеров вы можете обратиться к расширенному руководству .'
			}
		]
	}
};

export default classesStoreModule;
